_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ШаблоныЛимитированныхЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_ШаблоныЛимитированныхЗатрат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ШаблоныЛимитированныхЗатрат/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Функция ПолучитьЗначениеЛимЗатраты(ЛимЗатрата)
	
	Возврат ЛимЗатрата.ЗначениеЗатратыПоУмолчанию;
	
КонецФункции

&НаКлиенте
Процедура ЛимитированныеЗатратыЛимЗатратаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	НайденныеСтроки = Объект.ЛимитированныеЗатраты.НайтиСтроки(Новый Структура("ЛимЗатрата",ВыбранноеЗначение));
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Такая строка уже есть в табличной части'"));
	Иначе
		ТекДанные 			= Элементы.ЛимитированныеЗатраты.ТекущиеДанные;
		ТекДанные.Значение 	= ПолучитьЗначениеЛимЗатраты(ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыЛимЗатратаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПолучитьЛимитированныеЗатраты", ЭтотОбъект);
	ОткрытьФорму("Справочник.СМ_ЛимитированныеЗатраты.Форма.ФормаВыбораБезПомеченныхНаУдаление",,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЛимитированныеЗатраты(Результат, Структура) Экспорт
	
	ТекДанные = Элементы.ЛимитированныеЗатраты.ТекущиеДанные;
	Если ЗначениеЗаполнено(Результат) Тогда
		НайденныеСтроки = Объект.ЛимитированныеЗатраты.НайтиСтроки(Новый Структура("ЛимЗатрата",Результат));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Такая строка уже есть в табличной части'"));
		Иначе
			ТекДанные.ЛимЗатрата 	= Результат;
			ТекДанные.Значение 		= ПолучитьЗначениеЛимЗатраты(Результат);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
